Repository: turtleacademy/turtleacademy
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: es_ar, he_il, ru_ru

source: Augost
he_il: אוגוסט

source: September
he_il: ספטמבר

source: Octuber
he_il: אוקטובר

source: November
he_il: נובמבר

source: December
he_il: דצמבר

source: Sunday
he_il: ראשון

source: Monday
he_il: שני

source: Thuesday
he_il: שלישי

source: Wednesday
he_il: רביעי

source: Thursday
he_il: חמישי

source: Friday
he_il: שישי

source: Saturday
he_il: שבת

source: About Turtle Academy
he_il: על אקדמיית הצב

source: Using Turtle Academy site
he_il: שימוש באתר

source: Turtle Academy for teachers
he_il: אקדמיית הצב למורים

source: Contact Us
es_ar: Contáctenos
he_il: צור קשר
ru_ru: Контакты

source: Report a problem
he_il: דווח על בעיה

source: Submit a comment
he_il: שלח תגובה

source: Suggest a feature
he_il: הצע פיצ'ר

source: Add comment to the program
he_il: הוסף הערה לתכנית

source: You must
he_il: אתה צריך

source: to comment
he_il: תגובות

source: Your name must contain at least 4 characters
he_il: שם המשתמש חייב להכיל לפחות 4 תוים

source: Subject should contain at least 3 Characters
he_il: על כותרת השיעור להכיל לפחות 2 תוים

source: Content should contain at least 3 Characters
he_il: על כותרת השיעור להכיל לפחות 2 תוים

source: Please enter your email address
he_il: בבקשה הכנס כתובת אי מייל תקינה

source: Submit
he_il: שלח

source: Project documentation
he_il: תיעוד הפרוייקט

source: Documentation
he_il: תיעוד

source: FAQ
he_il: שאלות נפוצות

source: Donate
he_il: תרום

source: TurtleAcademy
es_ar: La Academia de la Tortuga
he_il: אקדמיית הצב
ru_ru: Академия Черепашки

source: please contact the TurtleAcademy support
he_il: בבקשה צור קשר עם התמיכה

source: Welcome to TurtleAcademy
he_il: ברוכים הבאים לאקדמיית הצב

source: Username is already exist in the system
he_il: המשתמש כבר קיים במערכת

source: please choose another username
es_ar: Elije otro nombre de usuario
he_il: בבקשה בחר שם משתמש אחר

source: Hello
es_ar: Hola
he_il: שלום
ru_ru: Привет

source: Add Student
he_il: הוסף סטיודנט

source: Username
es_ar: Nombre de usuario
he_il: שם משתמש
ru_ru: Имя пользователя

source: Password
es_ar: Contraseña
he_il: ססמא
ru_ru: Пароль

source: Agree to
es_ar: Acuerdas que
he_il: אני מסכים ל
ru_ru: Принимаю

source: Terms of Use
es_ar: Condiciones de uso
he_il: תנאי שימוש
ru_ru: условия использования

source: Add student
he_il: הוסף סטיודנט

source: Add existing User
he_il: הוסף משתמש קיים

source: View student List
he_il: הצג רשימה סטודנטים

source: View student programs
he_il: הצג תוכניות סטודנטים

source: Add existing student
he_il: הוסף תלמיד קיים

source: Email
he_il: אי מייל

source: Back to add non existing user
he_il: חזור להוסיף תלמידים חדשים

source: Add to students
he_il: הוסף לתלמידים

source: please
es_ar: Por favor
he_il: בבקשה

source: Back to my account
he_il: חזרה לחשבון שלי

source: programs created by users
he_il: תוכניות שנוצרו על ידי המשתמשים

source: num
he_il: מס

source: pic
he_il: תמונה

source: creator
he_il: משתמש

source: program name
he_il: שם התכנית

source: Date Created
he_il: נוצר בתאריך

source: Last updated
he_il: עודכן לאחרונה

source: Actions
he_il: פעולות

source: View
he_il: הבט

source: Student List
he_il: רשימת משתמשים

source: Join date
he_il: תאריך הצטרפות

source: Back to add student page
he_il: חזרה לרשימת הסטודנטים

source: Save
he_il: שמור

source: Clear
he_il: נקה

source: Run
he_il: הרץ

source: Logo play ground
es_ar: Juega con logo
he_il: מגרש המשחקים של הצב

source: Do whatever you desire
es_ar: Haz lo que quieras
he_il: עשה כל אשר ברצונך

source: program 1
he_il: תכנית 1

source: Update
he_il: עדכן

source: Delete Program
he_il: מחק תכנית

source: Create a new Program
he_il: צור תכנית חדשה

source: Program Public page
he_il: עמוד התכנית הציבורי

source: public
he_il: ציבורי

source: Update pic
he_il: עדכן תמונה

source: Please rank
he_il: דרג בבקשה

source: Your rank
he_il: הדירוג שלך

source: Turtle Academy - User Registration
es_ar: Academia de la Tortuga - Registrar nuevo usuario
he_il: אקדמיית הצב - רישום משתמש
ru_ru: Академия Черепашки - Регистрация

source: Precedence
he_il: תעדוף

source: Solution
es_ar: Solución
he_il: פתרון
ru_ru: Решение

source: Don't know how to {name}
he_il: לא יודע מה זה

source: previous
he_il: הקודם

source: next
he_il: הבא

source: second
he_il: שניות

source: minute
he_il: דקות

source: hour
he_il: שעות

source: day
he_il: ימים

source: week
he_il: שבועות

source: month
he_il: חודשים

source: years
he_il: שנים

source: ago
he_il: לפניי

source: Lessons
es_ar: Lecciónes
he_il: שיעורים

source: User programs
he_il: תוכניות המשתמש

source: Help Us
es_ar: Ayúdanos
he_il: עזור לנו
ru_ru: Поддержите нас

source: Playground
he_il: מגרש המשחקים

source: News
es_ar: Noticias
he_il: חדשות

source: Forums
he_il: פורומים

source: My account
es_ar: Mi cuenta
he_il: החשבון שלי
ru_ru: Мой аккаунт

source: Help
es_ar: Ayuda
he_il: עזרה
ru_ru: Помощь

source: Log out
es_ar: Salir
he_il: התנתק
ru_ru: Выйти

source: Login
es_ar: Entrar
he_il: הכנס
ru_ru: Войти

source: Sign Up
es_ar: Registrarse
he_il: הרשם
ru_ru: Регистрация

source: Forums now avialable only in english
he_il: הפורומים זמינים כרגע באנגלית בלבד

source: Please press the following link in order to post on the forum.
es_ar: Por favor presione este link para publicar en el foro.
he_il: בבקשה הקלק על הלינק הבא כדי להיכנס לפורומים

source: A new window will be open
he_il: חלון חדש יפתח.

source: Enter forums
he_il: כניסה לפורומים

source: The easy way to learn programming
es_ar: La manera fácil de aprender a programar
he_il: הדרך הפשוטה ללמוד תכנות

source: Turtle Academy makes it surprisingly easy to start creating amazing shapes using the LOGO language
es_ar: La Academia de la Tortuga hace sorprendentemente simple empezar a dibujar con el lenguaje de programación logo
he_il: אקדמיית הצב הופכת את החוויה של יצירת צורות מדהימות בשפת לוגו לאטרקטיבית ופשוטה

source: Here are some examples for easy and fun programming
es_ar: Aquí hay unos ejemplos de programación sencila y divertida
he_il: להלן כמה דוגמאות עד כמה תכנות הוא פשוט וכייפי

source: Create a Spiral
es_ar: Crear una espiral
he_il: יצירת ספירלה

source: Cool flower
es_ar: Una flor Bonita
he_il: פרח מגניב

source: repeat 8 [rt 45 repeat 6 [repeat 90 [fd 1 rt 2] rt 90]] ht
es_ar: repetir 8 [ de 45 repetir 6 [ repetir 90 [ ad 1 de 2 ] de 90]] ot
he_il: חזור 8 [ימ 45 חזור 6 [חזור 90 [קד 1 ימ 2] ימ 90]] החבאצב

source: Crazy octagon
es_ar: Octágono Loco
he_il: מתומנים משוגעים

source: cs repeat 36 [ rt 10 repeat 8 [ fd 25 lt 45]] ht
es_ar: bp repetir 36 [de 10 [ repetir 8 [ ad 25 iz 45 ]] ot
he_il: נמ חזור 36 [ימ 10 חזור 8 [קד 25 שמ 45]] החבאצב

source: Let's start having fun programming
es_ar: Empezemos a divertirnos a través de la programación
he_il: בואו ונתחיל לתכנת בכיף

source: Free Lessons
es_ar: Lecciones libres
he_il: לשיעורי החינם

source: Sign In for free
es_ar: Regístrate gratis
he_il: הירשם בחינם

source: I got the passion for programming thanks to Turtle Academy
es_ar: Recibí la pasión por programar gracias a la academia de la tortuga
he_il: יש לי תשוקה לתכנות הודות לאקדמיית הצב

source: Really easy to use
es_ar: Muy fácil de usar
he_il: מאד קל לשימוש

source: My son is enjoying studying programming
es_ar: Mi hijo disfruta de aprender a programar
he_il: הילד שלי נהנה לתכנת

source: Project goal
es_ar: Objetivo del Proyecto
he_il: מטרות הפרוייקט

source: Our objective is to teach programming principles in a fun and easy way making programming an accessible competancy to every child in the world
es_ar: Nuestro objetivo es enseñar a programar de manera fácil y divertida convirtiendo la programación en accesible para cada niño del mundo.
he_il: מטרותינו הן ללמד את יסודות התכנות באופן כייפי ופשוט , ולהפוך אותו לנגיש לכל הילדים בעולם

source: In the (quite near) future everything we will do will require basic programming abilities, and therefore it is important to learn this skill and learn to like it
es_ar: En el futuro cercano, todo lo que hagamos requerirá capacidad básica de programación, por lo que es importante comenzar a adquirir la destreza para hacerlo
he_il: בעתיד הקרוב(מאד) כמעט כל דבר ידרוש יכולות תכנות בסיסיות , ובגלל זה חשוב לדעת תכנות ואפילו לאהוב את זה

source: Making programming visual provides very quick rewards for the efforts, making it perfect for young children who often have trouble setting long term goals
es_ar: Cuando la programación es visual se obtienen resultados rapidos lo que lo hace ideal para niños pequeños
he_il: עשיית התכנות נגיש עם תוצאות מיידיות על העשייה , עושה את זה מושלם עבור ילדים אשר לעיתים קרובות מסתבכים עם מטרות ארוכות טווח

source: Want to help
es_ar: Quiéres ayudar
he_il: רוצה לעזור

source: In order to make programming approachable for more people we need volunteers to translate the site to their own native languages
es_ar: Para hacer la programación más accesible necesitamos voluntarios que tradujan el sitio a su propio idioma
he_il: על מנת להפוך את התכנות נגיש ליותר אנשים אנחנו צריכים מתנדברים שתרגמו את האתר לשפות שונות

source: If you wish to help please
he_il: אם הנך מוכן לעזור בבקשה

source: We recomand you to use Chrome or Firefox browsers
he_il: אנחנו ממליצים להשתמש בכרום או פיירפוקס

source: Action
es_ar: Acción
he_il: פעולה
ru_ru: Действие

source: Hint
es_ar: Ayuda
he_il: רמז
ru_ru: Подсказка

source: Title
es_ar: Título
he_il: כותרת
ru_ru: Название

source: Explanation
es_ar: Explicación
he_il: הסבר
ru_ru: Объяснение

source: Save Lesson
es_ar: Gardar lección
he_il: שמירת שיעור
ru_ru: Сохранить урок

source: Delete Lesson
es_ar: Borrar lección
he_il: מחיקת שיעור
ru_ru: Удалить урок

source: lesson Steps
es_ar: pasos de la lección
he_il: צעדי השיעור
ru_ru: шаги урока

source: please choose step to edit
es_ar: Elija un paso a editar
he_il: בבקשה בחר צעד לעריכה
ru_ru: пожалуйста, выберите шаг для редактирования

source: Remove lesson step
es_ar: Borrar el paso del la lección
he_il: הסר צעד נוכחי
ru_ru: Удалить шаг

source: Lesson Title
es_ar: Título de la Lección
he_il: כותרת שיעור
ru_ru: Название урока

source: Lesson name
he_il: שם שיעור

source: Edit
es_ar: Editar
he_il: ערוך
ru_ru: Редактировать

source: Sample
es_ar: Ejemplo
he_il: דוגמאות
ru_ru: Пример

source: Sign Up for free
es_ar: Regístrate gratis
he_il: הירשם בחינם
ru_ru: Регистрация

source: Translate
es_ar: traduce
he_il: תרגם
ru_ru: Перевести

source: TurtleAcademy aspires to be available for kids all around the world.
es_ar: TurtleAcademy quiere estar disponible para todos los niños del planeta.
he_il: אקדמיית הצב שואפת להיות נגישה לילדים בכל העולם.
ru_ru: Академия Черепашки стремится быть доступной детям всего мира

source: if you wish to help translating the project please contact us.
es_ar: Si quieres ayudarnos a traducir el proyecto, contactanos.
he_il: אם אתה מוכן לעזור בתרגום הפרוייקט בבקשה צור קשר
ru_ru: если вы хотите помочь с переводом проекта, пожалуйста, свяжитесь с нами

source: Add some content
es_ar: Agregar contenido
he_il: הוסף תוכן
ru_ru: Добавьте содержимое

source: Did you like the lessons and you feel you can contribute more knowledge.
es_ar: Si te gustaron las lecciones y sientes que puedes contribuir más conocimientos.
he_il: האם אהבת את השיעורים ואתה מרגיש שביכולתך לתרום עוד ידע
ru_ru: Вам понравились уроки и вы хотите внести свой вклад.

source: Please register and create more lesson in your own native language.
es_ar: Registrate y crea una lección nueva en tu lengua nativa.
he_il: בבקשה הירשם וצור יותר שיעורים בשפת האם שלך
ru_ru: Пожалуйста, зарегистрируйтесь и создавайте уроки на вашем родном языке

source: after adding the lessons they can be available for kids all around the world.
es_ar: Después de agregar la lección estará disponible para todos los niños del mundo.
he_il: אחריי שתוסיפו שיעורים הם יוכלו להיות נגישים לילדים בכל העולם.
ru_ru: после добавления, уроки будут доступны детям по всему миру

source: Register users can create , save and share their own programs
he_il: משתמשים רשומים יכולים ליצור,לשמור ולעשות שייר לתוכניות שלהם

source: Email is being used by a registered user
es_ar: El email ya esta en uso
he_il: האיי מייל בשימוש ע"י משתמש אחר

source: if you forgot your password please press reset password
he_il: אם שכחת את ססמך בבקשה הקש על אחזור ססמא

source: TurtleAcademy password reset
he_il: אקדמיית הצב שחזור ססמא

source: Please check your email to continue with password reset
he_il: בבקשה בדוק את האיי מייל כדי למהשיך באתחול הססמא

source: Error while sending confirm Email
he_il: שגיאה בעת שליחת מייל אישור

source: Sign Up for Free
es_ar: Regístrate gratis
he_il: הירשם בחינם
ru_ru: Регистрация

source: Forgot Password
es_ar: Me olvidé mi contraseña
he_il: שכחתי ססמא
ru_ru: Забыл пароль

source: Never mind, I remember my password
es_ar: No importa, me acuerdo de mi contraseña
he_il: לא משנה, נזכרתי בססמא
ru_ru: Вспомнил пароль

source: Remind me
es_ar: Recuérdame
he_il: הזכר לי
ru_ru: Напомнить

source: Sign In
es_ar: Entrar
he_il: התחבר
ru_ru: Вход

source: Remember me
es_ar: Recordarme
he_il: זכור אותי
ru_ru: Запомнить

source: Forgot my password
es_ar: Me olvidé mi contraseña
he_il: שכחתי ססמא
ru_ru: Забыл пароль

source: with Google
he_il: באמצעות גוגל

source: with Yahoo
es_ar: con Yahoo
he_il: באמצעות יאהו

source: Thanks for signing up
he_il: תודה על הצטרפותך

source: Please check your email for confirmation
he_il: בבקשה בדוק את האיי מייל לאישור

source: Reset your password
es_ar: Restablecer contraseña
he_il: אפס את ססמתך
ru_ru: Сбросить пароль

source: Retype Password
es_ar: Repetir contraseña
he_il: הקלד ססמא שנית
ru_ru: Повторить пароль

source: Reset
es_ar: Restablecer
he_il: אפס
ru_ru: Сбросить

source: Your browser does not support canvas - an updated browser is recommended
es_ar: Tu navegador carece de soporte para el canvas - se recomienda descargar un browser mas avanzado
he_il: הדפדפן שלך אינו תומך בקנבס - מומלץ להשתמש בדפדפן עדכני יותר
ru_ru: Ваш браузер не поддерживает canvas - рекомендуется обновить браузер

source: Total Score
he_il: ניקוד

source: Who are we ?
es_ar: Quienes somos?
he_il: מי אנחנו
ru_ru: Кто мы?

source: project doc
es_ar: Documentación del Proyecto
he_il: תיעוד הפרוייקט

source: Show Lesson
es_ar: Mostrar Lección
he_il: הצג שיעור
ru_ru: Показать уроки

source: Show reserve words
es_ar: Mostrar palabras reservadas
he_il: הראה מילים שמורות
ru_ru: Показать зарезервированные слова

source: Turtle Academy - Translate a lesson
es_ar: Academia de la Tortuga - Traducir una lección
he_il: אקדמיית הצב - תרגם מערך שיעור
ru_ru: Академия Черепашки - Перевод урока

source: Step
es_ar: Paso
he_il: צעד
ru_ru: Шаг

source: TurtleAcademy news
he_il: חדשות הצב

source: The Turtle news
he_il: חדשות אקדמיית הצב

source: Here you will find updates about the turtle development
he_il: כאן תמצאו עדכונים שוטפים לגביי הצב

source: news
es_ar: Noticias
he_il: חדשות

source: picture
he_il: תמונה

source: Created
he_il: נוצר

source: Updated
he_il: עודכן

source: Score
he_il: נקודות

source: Account Settings
es_ar: Configuración de cuenta
he_il: הגדרות חשבון
ru_ru: Настройки аккаунта

source: coming soon
es_ar: vendrá pronto
he_il: בקרוב
ru_ru: скоро

source: Create a new program
he_il: צור תכנית חדשה

source: Add a new lesson
es_ar: Crear una nueva lección
he_il: הוסף שיעור חדש
ru_ru: Добавить новый урок

source: My Messages
he_il: ההודעות שלי

source: User progress
he_il: התקדמות המשתמש

source: My progress
he_il: ההתקדמות שלי

source: My private profile
he_il: הפרופיל הפרטי שלי

source: My public profile
he_il: הפרופיל הציבור שלי

source: My lessons
he_il: השיעורים שלי

source: From
he_il: מאת

source: Date
he_il: תאריך

source: Subject
he_il: נושא

source: User Programs
he_il: תוכניות המשתמש

source: Your Programs
he_il: התכניות שלך

source: for [i 10 100 10] [fd :i rt 90] ht
es_ar: para [i 10 100 10] [ad :i de 90] ot

source: with google
es_ar: con Google

source: Messages
es_ar: Mensajes
ru_ru: Сообщения

source: Your lessons
es_ar: Tus lecciones
ru_ru: Ваши уроки

source: Project doc
es_ar: Documentación del Proyecto
ru_ru: Документация проекта

source: Create new Lesson
es_ar: Crear una nueva lección
ru_ru: Создать новый урок
