Repository: turtleacademy/turtleacademy
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: es_ar, he_il, ru_ru

source: Turtle Academy - learn logo programming in your browser
es_ar: La Academia de la Tortuga - aprende logo desde tu navegador
he_il: אקדמיית הצב - למד תכנות לוגו היישר מתוך הדפדפן
ru_ru: Академия Черепашки - учись программированию на языке Лого в браузере

source: free programming materials for kids
he_il: חומרי לימוד חינמיים לילדים
ru_ru: бесплатные материалы по программированию для детей

source: TurtleAcademy learn programming for free
es_ar: La Academia de la Tortuga - aprende logo desde tu navegador
he_il: אקדמיית הצב - למד תכנות לוגו היישר מתוך הדפדפן
ru_ru: Академия Черепашки учит программированию бесплатно

source: Your browser is not supporting canvas
es_ar: Tu navegador carece de soporte para el canvas
he_il: הדפדפן שלך אינו תומך בקנבס
ru_ru: Ваш браузер не поддерживает canvas

source: We recoomnd you to use Chrome or Firefox browsers
he_il: אנחנו ממליצים להשתמש בכרום או פיירפוקס
ru_ru: Мы рекомендуем использовать браузеры Chrome или Firefox

source: Next
es_ar: Siguiente
he_il: הבא
ru_ru: Вперёд

source: Prev
es_ar: Anterior
he_il: הקודם
ru_ru: Назад

source: User has been confirmed
he_il: המשתמש אושר

source: Thank you
es_ar: Gracias
he_il: תודה

source: Please
es_ar: Por favor
he_il: בבקשה

source: We are missing email address or generated key
he_il: חסר לנו את כתובת האימייל או המפתח האישי

source: Please double check your email
he_il: בבקשה בדוק שנית את כתובת האי מייל

source: The key or email doesn't appear in our database
he_il: האיי מייל או המפתח האישי אינם מופיעים במאגר הנתונים

source: login
es_ar: Ingresar
he_il: להכנס
ru_ru: логин

source: confirm registration
he_il: אשר הרשמה

source: Thanks for registering
es_ar: Gracias por registrarte
he_il: תודה על ההרשמה

source: Turtle Academy
es_ar: La Academia de la Tortuga
he_il: אקדמיית הצב
ru_ru: Академия Черепашки

source: Project Documentation
es_ar: Documentación del Proyecto
he_il: תיעוד הפרוייקט
ru_ru: Документация проекта

source: About the project
es_ar: Acerca del proyecto
he_il: על הפרוייקט
ru_ru: О проекте

source: The project contains a client side learning environment and a compiler for the <a target='_bjlank' href='http://he.wikipedia.org/wiki/%D7%9C%D7%95%D7%92%D7%95_(%D7%A9%D7%A4%D7%AA_%D7%AA%D7%9B%D7%A0%D7%95%D7%AA)'>Logo</a> Programming language.
es_ar: El proyecto incluye un ambiente de trabajo y un compilador para el lenguaje de programación <a target='_bjlank' href='http://es.wikipedia.org/wiki/Logo_(lenguaje_de_programaci%C3%B3n)'>Logo</a>.
he_il: הפרוייקט מכיל סביבת לימוד בצד לקוח ומהדר לשפת התכנות לוגו
ru_ru: Проект содержит среду обучения и интерпретатор языка программирования <a target='_bjlank' href='http://he.wikipedia.org/wiki/%D7%9C%D7%95%D7%92%D7%95_(%D7%A9%D7%A4%D7%AA_%D7%AA%D7%9B%D7%A0%D7%95%D7%AA)'>Logo</a>.

source: The project enables to learn the Logo language and programming principles and can be used for programming logo
es_ar: El proyecto permite aprender el lenguaje de programación Logo y principios de programción y puede ser usado para programar en Logo
he_il: הפרוייקט מאפשר ללמוד תכנות בשפת לוגו וכן את עקרונות התכנות , כמו כן יכול לשמש לפיתוח בשפת לוגו
ru_ru: Проект позволяет обучиться языку Лого и принципам программирования, и может быть использован для программирования на Лого

source: Why was it done
es_ar: Por qué fue hecho
he_il: למה עשינו אותו
ru_ru: Почему это было сделано

source: My brother has been volunteering in a primary school in Israel for the past few years.
es_ar: Mi hermano estuvo voluntarizandose en una escuela primaria en Israel en los últimos años
he_il: .אחי מתנדב במהלך השנים האחרונות בבתי ספר יסודיים בישראל
ru_ru: Мой брат на протяжении последних лет был добровольцем в средней школе в Израиле.

source: He was trying to instill the basic programming skills in the children and he discovered that there are three main problems.
es_ar: Él intento enseñar a los niños conceptos básicos de programación y descubrió tres problemas principales.
he_il: הוא ניסה להנחיל את יסודות התכנות אצל הילדים וגילה שישנן שלוש בעיות עיקריות.
ru_ru: Он обучал детей основам программирования и заметил три основные проблемы.

source: The first is the language barrier (all the programming languages are using English and the children's do not speak the language ),
es_ar: El primero es la barrera del idioma: todos los lenguajes de programación utilizan el Inglés pero los chicos no conocen el idioma
he_il: הבעייה הראשונה היא מחסום השפה (כל השפות תכנות כתובות באנגלית והילדים לא דיברו או כתבו באנגלית),
ru_ru: Во-первых, языковой барьер (почти все языки программирования используют английский, но не все дети его знают),

source: the second issue is that currently there are not many online learning programs which address children.
es_ar: el segundo asunto es que no hay plataformas de aprendizaje online que esten orientadas a niños.
he_il: הבעייה השנייה היא שלא קיימות הרבה תוכנות אונליין שקהל היעד שלהם הוא ילדים
ru_ru: во-вторых, в настоящее время не так много онлайн обучающих программ для детей.

source: The third issue is the installation requirement of an appropriate programming environment in order to be able to start programming.
es_ar: El tercer asunto es el requerimiento de instalar un ambiente de programación para empezar a programar
he_il: הבעייה השלישית הוא דרישות ההתקשה של סביבת הפיתוח על מנת להתחיל לכתוב פקודות ולתכנת
ru_ru: И в-третьих, необходимость установки соответствующей среды разработки, необходимой для программирования.

source: For this reason we thought it would be a good idea to join forces and create TurtleAcademy
es_ar: Por esta razón creímos que sería una excelente idea sumar fuerzas y crear la Academia de la Tortuga
he_il: לכן חשבנו שזה רעיון טוב ונרתמנו למשימה ביחד כדי ליצור את אקדמיית הצב
ru_ru: Поэтому мы решили, что было бы здорово объединить силы и создать Академию Черепашки

source: The inspiration for the project came from other projects like <a target='_blank' href='http://www.khanacademy.org/'> Khanacademy</a> And a javascript learning project named <a target='_blank' href='http://www.codecademy.com/'>Codecademy</a>
es_ar: Inspirado en otros proyecto como <a target='_blank' href='http://www.khanacademy.org/'> Khanacademy</a> y el proyecto de enseñanza de Javascript online llamado <a target='_blank' href='http://www.codecademy.com/'>Codecademy</a
he_il: ההשראה לפרוייקט התקבלה בין היתר מפרוייקטים כגון <a target="_blank" href="http://www.khanacademy.org/">האקדמיה של חאן</a> ומפרוייקט לימוד גאווהסקריפט בשם <a target="_blank" href="http://www.codecademy.com/">קודקדמי</a>
ru_ru: Мы вдохновлялись другими существующими проектами, такими как <a target='_blank' href='http://www.khanacademy.org/'> Khanacademy</a> и самоучитель JavaScript <a target='_blank' href='http://www.codecademy.com/'>Codecademy</a>

source: Who we are ?
es_ar: Quienes somos?
he_il: מי אנחנו

source: Lucio - Webmaster and amateur ping pong player
es_ar: Lucio - Webmaster y aficionado al ping pong
he_il: לוסיו - מפתח האתר ושחקן פינג פונג חובב
ru_ru: Люсио - веб-мастер и любитель настольного тенниса

source: Ofer - Father of three , amateur entrepreneur
es_ar: Ofer - Padre de tres niños, emprendedor aficionado
he_il: עופר - אבא לשלושה, ויזם חובב
ru_ru: Офер - отец троих детей, начинающий преприниматель

source: Amir - Colnect master , uncle of six
es_ar: Amir - El Dueño de Colnect, tío de seis sobrinos
he_il: אמיר - מיסטר קולנקט, ודוד לשישה
ru_ru: Амир - мастер Colnect-а, дядя шести детей

source: Dana - Tiger painter , likes to read lessons
es_ar: Dana - Pintora tigresa, ama leer lecciones
he_il: ציירת נמרים וחובבת קדריאת מערכי שיעור
ru_ru: Дана - рисует тигров, любит читать уроки

source: Ayelet - Full time mother
es_ar: Ayelet - Madre a tiempo completo
he_il: איילת - אמא במשרה מלאה
ru_ru: Айэлет - профессональная мать

source: Almog - Blogger , made his first QA steps at the age of seven
es_ar: Almog - Blogger, hizo sus primeros pasos en QA a los siete años de edad
he_il: אלמוג - בלוגר צעיר שעשה את צעדיו הראשונים בתחום ה QA בגיל 7
ru_ru: Алмог - Блогер, впервые попробовал себя в качестве тестировщика в 7 лет

source: Inbar - Very talented Wii player
es_ar: Inbar - Talentosa jugadora de Wii
he_il: ענבר - שחקן wii מוכשר
ru_ru: Инбар - очень талантливый игрок Wii

source: Raz - QA and vegetarian
es_ar: Raz - QA y vegetariano
he_il: רז - QA וצמחוני
ru_ru: Раз - тестировщик и вегетарианец

source: Yuval - QA and future Messi
es_ar: Yuval - QA y próximo Messi
he_il: יובל - QA ומסי עתידי
ru_ru: Юваль - тестировщик и будущий Месси

source: Tricks
es_ar: Trucos
he_il: טריקים
ru_ru: Трюки

source: New commands that have been learned will be saved even after the browser restarts
es_ar: Nuevos comandos aprendidos serán recordados incluso después de reiniciar el navegador
he_il: הפקודות החדשות שנלמדו נשרמות גם לאחר אתחול הדפדפן
ru_ru: Освоенные команды будут сохраняться даже при рестарте браузера.

source: The turtle remembers the student's progress over time, allowing the student to follow his own progress
es_ar: La tortuga recuerda el progreso del estudiante, lo que permite al estudiante aprovechar mejor sus avances
he_il: הצב זוכר את התקדמות התלמיד לארוך זמן , ובכך מאפשר לתלמיד מעקב אחריי התקדמותו
ru_ru: Черепашка запоминает, какие уроки пройдены.

source: The drawing that appear below actually show live logo programs !
es_ar: El dibujo que aparece aqui abajo muestra programas logo reales!
he_il: הציורים המופיעים מטה הם בעצם תוכניות לוגו חיות
ru_ru: Изображение ниже создано при помощи языка Лого.

source: Credits
es_ar: Créditos
he_il: קרדיטים
ru_ru: Благодарности

source: A lot of written libraries facilitate the creation of the website
es_ar: Muchas librerías de utilidades facilitaron la creación de este sitio
he_il: הרבה ספריות נכתבו המקילות על כתיבת הפרוייקט
ru_ru: Множество существующих библиотек было использовано при создании веб-сайта

source: <a target='_blank' href='http://www.calormen.com/Logo/'> Joshua Bell - wrote the logo component </a>
es_ar: <a target='_blank' href='http://www.calormen.com/Logo/'> Joshua Bell - escribió el componente logo </a>
he_il: <a target="_blank" href="http://www.calormen.com/Logo/">Joshua Bell - כתיבת רכיב עבור שפת לוגו</a>
ru_ru: <a target='_blank' href='http://www.calormen.com/Logo/'> Joshua Bell - создатель модуля Лого</a>

source: <a target='_blank' href='https://github.com/replit/jq-console'> jsconsole- wrote the input element ( Console ) </a>
es_ar: <a target='_blank' href='https://github.com/replit/jq-console'> jsconsole- es el elemento de entrada ( Consola ) </a>
he_il: <a target="_blank" href="https://github.com/replit/jq-console">jsconsole - כתיבת רכיב קלט (קונסול)</a>
ru_ru: <a target='_blank' href='https://github.com/replit/jq-console'> jq-console - написал виджет ввода команд (консоль)</a>

source: <a target='_blank' href='http://jquery.com'> jquery - component which enabled easy java scripting </a>
es_ar: <a target='_blank' href='http://jquery.com'> jquery - proporciona infraestructura para desarrollar más fácil en Javascript </a>
he_il: <a target="_blank" href="http://jquery.com">jquery - רכיב המאפשר תכנות פשוט בג'אווהסקריפט</a>
ru_ru: <a target='_blank' href='http://jquery.com'> jquery - библиотека, облегчающая разработку на Java Script</a>

source: <a target='_blank' href='http://jqueryui.com/'> jqueryui - a collection of graphical components </a>
es_ar: <a target='_blank' href='http://jqueryui.com/'> jqueryui - una colección de componentes gráficos </a>
he_il: <a target="_blank" href="http://jqueryui.com/">jqueryui - אוסף רכיבים גרפיים ל-jquery</a>
ru_ru: <a target='_blank' href='http://jqueryui.com/'> jqueryui - набор графических компонентов</a>

source: <a target='_blank' href='http://api.jquery.com/category/plugins/templates/'> jquerytemplates - enable transmission of data to html </a>
es_ar: <a target='_blank' href='http://api.jquery.com/category/plugins/templates/'> jquerytemplates - permite la transmisión de datos a HTML </a>
he_il: <a target="_blank" href="http://api.jquery.com/category/plugins/templates/">jquerytemplates - מאפשר המרת מבני נתונים ל-html</a>
ru_ru: <a target='_blank' href='http://api.jquery.com/category/plugins/templates/'> jquerytemplates - преобразование данных в HTML</a>

source: Contact us
es_ar: Contáctenos
he_il: צרו קשר
ru_ru: Контакты

source: Send an email
es_ar: Envía un email
he_il: שלח email
ru_ru: Отправить email

source: About
es_ar: Documentación
he_il: אודות
ru_ru: О нас

source: Turtle academy
es_ar: La Academia de la Tortuga
he_il: אקדמיית הצב

source: Why to register
he_il: מדוע להירשם

source: Save your progress
he_il: שמור את ההתקדמות שלך

source: Your progress will be kept , and you will be able to see exactly which steps you have done before
he_il: ההתקדמות שלך תישמר , תוכל לדעת בדיוק איזה צעדים ושיעורים עשית לפניי

source: Remember your special commands
he_il: זכור את פקודות ה'למד' המיוחדות שלך

source: You can teach the turtle some new commands
he_il: אתה יכול ללמד את הצב פקודות חדשות

source: See the lessons 'The turtle is learning'
he_il: ראה את השיעור 'הצב לומד'

source: in order for the commands to be save in your next visit you should be a register user
he_il: כדי שהפקודות ישמרו בביקור הבא שלך באתר באופן אוטומטי אתה צריך להיות משתמש רשום

source: Special lessons
es_ar: Lecciónes especial
he_il: שיעורים מיוחדים

source: There are special lessons available only for registered users
he_il: ישנם שיעורים מיוחדים הנגישים רק למשתמשים רשומים

source: cool lessons with cool features
he_il: שיעורים מגניבים עם תוספות מגניבות

source: Its free
he_il: זה בחינם

source: The registration is for free
he_il: ההרשמה היא בחינם

source: Name
es_ar: Nombre
he_il: שם

source: Lucio
he_il: לוסיו

source: Webmaster and amateur ping pong player
es_ar: Webmaster y aficionado al ping pong
he_il: מפתח האתר ושחקן פינג פונג חובב

source: Ofer
he_il: עופר

source: Father of three , amateur entrepreneur
es_ar: Padre de tres niños, emprendedor aficionado
he_il: אבא לשלושה, ויזם חובב

source: Amir
he_il: אמיר

source: Colnect master , uncle of six
es_ar: El Dueño de Colnect, tío de seis sobrinos
he_il: מיסטר קולנקט, ודוד לשישה

source: Andy
he_il: אנדי

source: Feeding the turtle , Spanish section
he_il: מאכיל את הצב , אחראי ספרדית

source: Mona
he_il: מונה

source: Yoga master , Chinese section
he_il: מסטרית יוגה , אחראית סינית

source: Father of twins, German section
he_il: אבא לתאומים , אחראי גרמנית

source: Ayelet
he_il: איילת

source: Full time mother
es_ar: Madre a tiempo completo
he_il: אמא במשרה מלאה

source: Dana
he_il: דנה

source: Tiger painter , likes to read lessons
es_ar: Pintora tigresa, ama leer lecciones
he_il: ציירת נמרים וחובבת קריאת מערכי שיעור

source: Almog
he_il: אלמוג

source: Blogger , made his first QA steps at the age of seven
es_ar: Blogger, hizo sus primeros pasos en QA a los siete años de edad
he_il: בלוגר צעיר שעשה את צעדיו הראשונים בתחום ה QA בגיל 7

source: Inbar
es_ar: Invar
he_il: ענבר

source: Very talented Wii player
es_ar: Talentosa jugadora de Wii
he_il: שחקן wii מוכשר

source: Raz
es_ar: Secreto
he_il: רז

source: QA and vegetarian
he_il: QA וצמחוני

source: Yuval
he_il: huck

source: QA and future Messi
he_il: QA ומסי עתידי

source: Joshua Bell - wrote the logo component
he_il: ג'ושוע בל - כתיבת רכיב עבור שפת לוגו

source: Math cats - Logo 15 word challange compitition
he_il: חתולי המתמטיקה - תחרות אתגר 15 המילים בלוגו

source: jquery - component which enabled easy java scripting
he_il: jquery - רכיב המאפשר תכנות פשוט בג'אווהסקריפט

source: jqueryui - a collection of graphical components
he_il: jqueryui - אוסף רכיבים גרפיים ל

source: jquerytemplates - enable transmission of data to html
he_il: jquerytemplates - מאפשר שליחת דאטה לדף אינטרנט

source: is open to hear any ideas or suggestion
he_il: פתוחים לקבל רעיונות והצעות כלשהן

source: or problems
he_il: או בעיות

source: Please contact us.
he_il: בבקשה צרו קשר

source: forward
es_ar: adelante
he_il: קדימה
ru_ru: вперёд

source: fd
es_ar: ad
he_il: קד
ru_ru: вп

source: Don't know how to
es_ar: No se como hacer
he_il: לא יודע מה זה
ru_ru: Не знаю что это

source: back
es_ar: atras
he_il: אחורה
ru_ru: назад

source: to
es_ar: para
he_il: למד
ru_ru: до

source: word
es_ar: palabra
he_il: מילה
ru_ru: слово

source: list
es_ar: lista
he_il: רשימה
ru_ru: список

source: sentence
es_ar: oracion
he_il: משפט
ru_ru: предложение

source: combine
es_ar: combinar
he_il: צרף
ru_ru: соединить

source: reverse
es_ar: hacia atras
he_il: אחורנית
ru_ru: наоборот

source: gensym
es_ar: gensim
he_il: צורסמל
ru_ru: ген_сим

source: first
es_ar: primer
he_il: ראשון
ru_ru: первый

source: last
es_ar: ultimo
he_il: אחרון
ru_ru: последний

source: print
es_ar: imprimir
he_il: הדפס
ru_ru: напиши

source: sin
es_ar: sen
he_il: סינוס

source: cos
he_il: קוסינוס

source: tan
he_il: טנגנס
ru_ru: tg

source: random
es_ar: azar
he_il: אקראי
ru_ru: случайное

source: true
es_ar: verdad
he_il: אמת
ru_ru: истина

source: false
es_ar: falso
he_il: שקר
ru_ru: ложь

source: and
es_ar: y
he_il: וגם
ru_ru: и

source: or
es_ar: o
he_il: או
ru_ru: или

source: xor
es_ar: oex
he_il: אומוציא

source: not
es_ar: no
he_il: לא
ru_ru: не

source: bk
es_ar: at
he_il: אח
ru_ru: нд

source: lt
es_ar: iz
he_il: שמ
ru_ru: лв

source: left
es_ar: izquierda
he_il: שמאלה
ru_ru: налево

source: rt
es_ar: de
he_il: ימ
ru_ru: пр

source: right
es_ar: derecha
he_il: ימינה
ru_ru: направо

source: home
es_ar: casa
he_il: הביתה
ru_ru: домой

source: st
es_ar: mt
he_il: הצ
ru_ru: пч

source: showturtle
es_ar: mostrartortuga
he_il: הצגצב
ru_ru: покажи_черепашку

source: ht
es_ar: ot
he_il: הח
ru_ru: сч

source: hideturtle
es_ar: ocultartortuga
he_il: החבאצב
ru_ru: спрячь_черепашку

source: clean
es_ar: borrar
he_il: נקה
ru_ru: очисти

source: cs
es_ar: bp
he_il: נמ
ru_ru: оэ

source: clearscreen
es_ar: borrarpantalla
he_il: נקהמסך
ru_ru: очисти_экран

source: label
es_ar: etiqueta
he_il: תווית
ru_ru: надпись

source: pendown
es_ar: bajarlapiz
he_il: הורדעט
ru_ru: перо_опусти

source: pu
es_ar: sl
he_il: הרע
ru_ru: пп

source: penup
es_ar: subirlapiz
he_il: הרםעט
ru_ru: перо_подними

source: penpaint
es_ar: lapizpinta
he_il: עטצובע
ru_ru: перо_рисует

source: setcolor
es_ar: ponercolor
he_il: שנהצבע
ru_ru: задать_цвет

source: setpencolor
es_ar: ponercolorlapiz
he_il: שנהצבעעט
ru_ru: задать_цвет_пера

source: setwidth
es_ar: ponergrosor
he_il: שנהרוחב
ru_ru: задать_ширину

source: setpensize
es_ar: ponergrosorlapiz
he_il: שנהגודלעט
ru_ru: задать_толщину_пера

source: pencolor
es_ar: lapizcolor
he_il: צבעעט
ru_ru: цвет_пера

source: pensize
es_ar: lapizgrosor
he_il: גודלעט
ru_ru: толщина_пера

source: repeat
es_ar: repetir
he_il: חזור
ru_ru: повтори

source: repcount
es_ar: repetircontar
he_il: מונהחזרה
ru_ru: число_повторов

source: if
es_ar: si
he_il: אם
ru_ru: если

source: ifelse
es_ar: sino
he_il: אםאחרת
ru_ru: если_иначе

source: iftrue
es_ar: siverdad
he_il: אםאמת
ru_ru: если_истина

source: iffalse
es_ar: sifalso
he_il: אםשקר
ru_ru: если_ложь

source: for
es_ar: para
he_il: עבור
ru_ru: для

source: end
es_ar: fin
he_il: סוף
ru_ru: конец

source: Unexpected end of instructions
es_ar: Se necesitan mas instrucciones
he_il: חסר סוף לפקודות
ru_ru: Неожиданный конец инструкции

source: Expected identifier
es_ar: Se necesita identificador
he_il: מזהה היה צפוי
ru_ru: Ожидается идентификатор

source: Please don't try to override primitive functions
es_ar: No se pueden utilizar modificar primitivas del sistema
he_il: אין להשתמש במילים שמורות להגדרת פונקציות
ru_ru: Пожалуйста, не пытайтесь переопределить встроенную функцию

source: Error
he_il: שגיאה
ru_ru: Ошибка

source: hint
es_ar: Ayuda
he_il: רמז
ru_ru: подсказка

source: sum
es_ar: sumar
he_il: סכום
ru_ru: сумма

source: minus
es_ar: restar
he_il: חיסור
ru_ru: минус

source: make
es_ar: hacer
he_il: עשה
ru_ru: создать

source: pd
es_ar: bl
he_il: הוע
ru_ru: по

source: stop
es_ar: parar
he_il: עצור
ru_ru: стоп

source: Hi
es_ar: Hola
he_il: שלום
ru_ru: Привет

source: Welcome to the Turtle world
es_ar: Bienvenidos al Mundo de la Tortuga
he_il: וברוכים הבאים לעולמו של הצב
ru_ru: Добро пожаловать в мир Черепашки

source: Please enter your username
es_ar: Ingrese su nombre de usuarion
he_il: בבקשה הכנס את שם המשתמש שלך
ru_ru: Пожалуйста, введите имя пользователя

source: Please enter your password
es_ar: Ingrese su contraseña
he_il: בבקשה הכנס את הססמא שלך
ru_ru: Пожалуйста, введите пароль

source: Your username must contain at least 4 characters
es_ar: Su nombre debe contener al menos 4 caracteres
he_il: שם המשתמש חייב להכיל לפחות 4 תוים
ru_ru: Имя пользователя должно быть не короче 4 символов

source: Your password must contain at least 5 characters
es_ar: Su contraseña debe contener al menos 5 caracteres
he_il: הסממא חייבת להכיל לפחות 5 תוים
ru_ru: Пароль должен быть не короче 5 символов

source: Add lesson step
es_ar: Agregar un paso
he_il: הוסף צעד לשיעור
ru_ru: Добавить шаг

source: Are you sure you want to delete the lesson
es_ar: Está seguro que quiere borrar la lección
he_il: אתה בטוח שברצונך למחוק את השיעור ?
ru_ru: Вы уверены, что хотите удалить урок

source: Your lessson has been deleted
es_ar: Su lección fue borrada
he_il: השיעור נמחק בהצלחה
ru_ru: Урок удалён

source: successfully deleted
es_ar: borrada exitosamente
he_il: נמחק בהצלחה
ru_ru: удаление успешно

source: an error occured
es_ar: Ocurrió un error
he_il: קרתה שגיאה
ru_ru: ошибка

source: Lesson title should contain at least 2 caracters
es_ar: El título de la lección debe contener al menos 2 caracteres
he_il: על כותרת השיעור להכיל לפחות 2 תוים
ru_ru: Название урока должно быть не короче 2 символов

source: You must save the lesson before show lesson
es_ar: Debe salvar la lección antes de mostrar lección
he_il: חובה לשמור את השיעור לפני הצגתו
ru_ru: Сохраните урок перед показом

source: Please enter a valid email address
he_il: בבקשה הכנס כתובת אי מייל תקינה

source: Having some problems to register
he_il: קיימות בעיות בהרשמה

source: setlabelheight
es_ar: poneralturaetiqueta
he_il: קבעגודלתווית
ru_ru: задать_высоту_надписи

source: setheading
es_ar: iponerdireccion
he_il: כווןראש
ru_ru: задать_курс

source: seth
es_ar: ponerd
he_il: כר
ru_ru: задать_курс

source: setxy
es_ar: ponerxy
he_il: קבעמיקוםצב
ru_ru: задать_гор_верт

source: sety
es_ar: ponery
he_il: קבעמיקוםאנכי
ru_ru: задать_верт

source: setx
es_ar: ponerx
he_il: קבעמיקוםאפקי
ru_ru: задать_гор

source: arc
es_ar: arco
he_il: קשת
ru_ru: дуга

source: pos
he_il: מיקום
ru_ru: коорд

source: xcor
es_ar: coorx
he_il: מיקוםאפקי
ru_ru: коорд_гор

source: ycor
es_ar: coory
he_il: מיקוםאנכי
ru_ru: коорд_верт

source: heading
es_ar: direccion
he_il: לאן
ru_ru: курс

source: towards
es_ar: hacia
he_il: כיצדלהגיע
ru_ru: направление

source: item
he_il: פריט
ru_ru: элемент

source: pick
es_ar: elije
he_il: בחר
ru_ru: выбрать

source: butfirst
es_ar: salvoprimero
he_il: בליראשון
ru_ru: кроме_первого

source: bf
es_ar: sp
he_il: בר
ru_ru: кр_пер

source: butlast
es_ar: salvoultimo
he_il: בליאחרון
ru_ru: кроме_последнего

source: bl
es_ar: su
he_il: בא
ru_ru: кр_пос

source: fill
es_ar: llenar
he_il: צבערקע

source: filled
es_ar: llenado
he_il: צבערקענוצר

source: run
es_ar: correr
he_il: הרץ

source: lesson
es_ar: Lección
he_il: שיעור

source: difference
he_il: שוני

source: Command and number should be seperate by space e.g forward 50 and not forward50
he_il: הפקודות צריכות להיות מופרדות על ידי רווח לדוגמא: קדימה 50 ולא קדימה50

source: black
he_il: שחור

source: blue
he_il: כחול

source: lime
he_il: ליים

source: cyan
he_il: סיין

source: red
he_il: אדום

source: yellow
he_il: צהוב

source: white
he_il: לבן

source: brown
he_il: חום

source: green
he_il: ירוק

source: salmon
he_il: סלמון

source: purple
he_il: סגול

source: orange
he_il: כתום

source: gray
he_il: עפור

source: January
he_il: ינואר

source: February
he_il: פברואר

source: March
he_il: מרץ

source: April
he_il: אפריל

source: May
he_il: מאי

source: June
he_il: יוני

source: July
he_il: יולי
